HR SCHEMA >>

EMPLOYEES
DEPARTMENTS
REGIONS
COUNTRY
JOBS
JOB_HISTORY
LOCATIONS

In [22]:
def oracle():
    import cx_Oracle
    import warnings
    warnings.filterwarnings('ignore')
    import pandas as pd
    
    conn = cx_Oracle.connect('HR/PASSWORD@LOCALHOST:1521/XE')
    df = pd.read_sql_query('''
    
    
    SELECT E.*, ROWNUMBER() OVER() AS rn
    FROM EMPLOYEES E
    
    
    
    
                        ''',con=conn)
    conn.close()
    pd.set_option('display.max_rows', 20000)
    pd.set_option('display.max_columns', 100)
    return df

oracle()

DatabaseError: Execution failed on sql '


    SELECT E.*, ROWNUMBER() OVER() AS rn
    FROM EMPLOYEES E




                        ': ORA-00904: "ROWNUMBER": invalid identifier

#cte

WITH CTE AS ( SELECT DEPARTMENT_ID, AVG(SALARY) AS AVG_SAL
    FROM EMPLOYEES GROUP BY DEPARTMENT_ID)
    SELECT MAX(AVG_SAL) FROM CTE

In [3]:
> SCALAR SUBQUERY :  RETURNS ONE ROW AND ONE COLUMN ONLY
> MULTIPLE ROW SUBQUERY: 1. MUL COLUM

SyntaxError: invalid syntax (702151208.py, line 1)

> last record
select * from employees where ROWID = (select max(ROWID) from employees)
SELECT * FROM (select * from employees order by ROWID DESC) WHERE ROWNUM=1

> FIRST N
SELECT * FROM EMPLOYEES WHERE ROWNUM<=N

> LAST N
SELECT * FROM (SELECT * FROM EMPLOYEES ORDER BY ROWID DESC) WHERE ROWNUM <= N

> NTH RECORD
select * from ( select a.*, rownum rnum from (SELECT * FROM EMPLOYEES order by ROWID ASC ) a where rownum <= 1) where rnum >= 1


>3 HIGHEST SALARIES
select distinct salary from employees a where 3 >= (select count(distinct salary) from employees b where a.salary <= b.salary) order by a.salary desc 

> inner join
select e.employee_id, d.department_name from employees  e inner join departments d on e.department_id=d.department_id

> fetch all the employee name with department ids
select e.first_name, d.department_id from
employees e left join departments d
on e.department_id = d.department_id

> RETURN SCHEMA
SELECT OWNER, TABLE_NAME, COLUMN_NAME, DATA_TYPE, DATA_LENGTH, NULLABLE FROM ALL_TAB_COLUMNS ORDER BY OWNER, TABLE_NAME, COLUMN_ID

> FULL JOIN
SELECT E.FIRST_NAME, D.DEPARTMENT_NAME FROM EMPLOYEES E FULL JOIN DEPARTMENTS D ON D.DEPARTMENT_ID = E.DEPARTMENT_ID

> LEFT (OUTER) JOIN
SELECT E.FIRST_NAME, D.DEPARTMENT_NAME FROM EMPLOYEES E LEFT JOIN DEPARTMENTS D ON D.DEPARTMENT_ID = E.DEPARTMENT_ID

> RIGHT (OUTER) JOIN
SELECT E.FIRST_NAME, D.DEPARTMENT_NAME FROM EMPLOYEES E RIGHT JOIN DEPARTMENTS D ON D.DEPARTMENT_ID = E.DEPARTMENT_ID

> CROSS JOIN  DOES NOT REQUIRE JOIN CONDITION, THIS RETURNS CARTESIAN PRODUCT
SELECT E.FIRST_NAME, D.DEPARTMENT_NAME FROM EMPLOYEES E CROSS JOIN DEPARTMENTS D

> NATURAL JOIN
SQL will decide on which column the table will join
if we use join condition it will give error
SELECT E.FIRST_NAME, D.DEPARTMENT_NAME FROM EMPLOYEES E NATURAL JOIN DEPARTMENTS D

> SALARY gt AVG SALARY 
SELECT E.FIRST_NAME FROM EMPLOYEES E
WHERE SALARY > (SELECT AVG(E.SALARY) FROM EMPLOYEES E)

In [12]:
x = [1,2,3]
y  = []
for i in enumerate(x):
    y.append(i)
print(i)

(2, 3)